popupHelp = popupHelp || {};

popupHelp.helpTexts = {

    "title" : [
        "Title",
        "Enter the title of the recording."
    ],

    "presenter" : [
        "Presenter(s)",
        "Enter the name of the presenter."
    ],
    
    "license" : [
        "License",
        "Enter the type of license under which you would like to distribute the recording. This data does not currently impact processing or distribution."
    ],
    
    "series" : [
        "Series",
        "If the recording is part of series, enter the name of the series. This is a single piece of metadata and has no other implications in the system."
    ],
    
    "subject" : [
        "Subject",
        "Enter a category or topic for the recording."
    ],
    
    "language" : [
        "Language",
        "Enter the primary language spoken in the recording."
    ],

    "description" : [
        "Description",
        "Enter a description of the recording."
    ],
    
    "distribution" : [
        "Distribution channel(s)",
        "Specify the channel(s) to which you would like this recording distributed."
    ],
    
    "startdate" : [
        "Start Date",
        "Select the start date for this recording."
    ],
    
    "starttime" : [
        "Start Time",
        "Select a start time for this recording, using 24-hour time. This is the precise time that recording will start; there is no buffer. Time select is local to the agent."
    ],
    
    "duration" : [
        "Duration",
        "Select a duration for this recording. Must be larger than 0 hours and 0 minutes."
    ],
    
    "agent" : [
        "Capture Agent",
        "Select the capture agent for this recording. If you do not have a working capture agent and you'd still like to test the scheduling of a recording, select \"demo_capture_agent\" and the system will simulate \"capture\" from a pre-loaded media file at the time and for the duration that you specify on this form."
    ],
    
    "input" : [
        "Recording Inputs",
        "Select the inputs that this recording will capture."
    ],
    
    "contributor" : [
        "Department",
        "Enter the name of the department associated with the recording."
    ]
};
