tap "homebrew/bundle"
tap "homebrew/services"
tap "microsoft/mssql-release"
tap "ngrok/ngrok"
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "awscli"
brew "glib"
brew "direnv"
brew "unixodbc"
brew "wxwidgets"
brew "erlang"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "pkg-config"
brew "guile"
brew "harfbuzz"
brew "python@3.10"
brew "honcho"
brew "libffi"
brew "libfido2"
brew "libpq"
brew "libxml2"
brew "libxmlsec1"
brew "mysql"
brew "mysql-client"
brew "openrtsp"
brew "pango"
brew "pillow"
brew "postgresql@15", restart_service: true, link: true
brew "virtualenv"
brew "pre-commit"
brew "python@3.9"
brew "rabbitmq"
brew "redis", restart_service: true
brew "telnet"
brew "weasyprint"
brew "microsoft/mssql-release/msodbcsql17"
brew "microsoft/mssql-release/msodbcsql18"
brew "microsoft/mssql-release/mssql-tools"
brew "microsoft/mssql-release/mssql-tools18"
cask "ngrok"
